
-- ====================== ÎÄ¼þÐÅÏ¢ ======================

-- ½£ÏÀÇéÔµonlineII Ëæ»úÈÎÎñÊý¾ÝÍ·ÎÄ¼þ
-- Edited by peres
-- 2005/08/08 PM 13:45

-- Ö»ÓÐÍíÉÏËûÃÇÊÇÔÚÒ»ÆðµÄ
-- Ëû¿¿½üËý£¬Óµ±§Ëý
-- ËûµÄÊÖÖ¸ºÍÆ¤·ô
-- Ëý¿´×ÅËû£¬ÐÄÀïÈáÈí¶øÌÛÍ´
-- ËýÏë£¬Ëý»¹ÊÇ°®Ëû
-- Ëý²»Ïë±§Ô¹Ê²Ã´
-- Ã¿ÌìÍíÉÏËûÃÇ¶¼ÔÚ×ö°®
-- Ëý²»ÖªµÀ£¬³ýÁËÕâÖÖ½Ó´¥£¬ËýµÄ°²È«¸ÐºÍÎÂÅ¯£¬»¹ÄÜ´ÓÄÄÀïÈ¡µÃ
-- ËýÏ²»¶ÄÇÒ»Ë²¼ä¡£·Â·ðÔÚºÚ°µµÄ´óº£ÉÏ£¬Æ¯ÏòÊÀ½çµÄ¾¡Í·

-- ======================================================

FactionBossName = {

	-- ÉÙÁÖ
	[1]="HuyÒn Tõ",

	-- Îäµ±
	[2]="Tö H¹c ch©n nh©n",

	-- ¶ëÃ¼
	[3]="Ch©n Nh­ s­ th¸i",
	
	-- Ø¤°ï
	[4]="Long T¹i Thiªn",

	-- ÌÆÃÅ
	[5]="L·o l·o",
	
	-- ÑîÃÅ
	[6]="Xa Th¸i Qu©n",
	
	-- Îå¶¾
	[7]="B¹ch Doanh Doanh",
	
}


FactionBossTitle = {

	-- ÉÙÁÖ
	[1]="Abbot",
	
	-- Îäµ±
	[2]="Sect Leader",

	-- ¶ëÃ¼
	[3]="Sect Leader",

	-- Ø¤°ï
	[4]="Bang chñ",
	
	-- ÌÆÃÅ
	[5]="L·o l·o",
	
	-- ÑîÃÅ
	[6]="Sect Leader",
	
	-- Îå¶¾
	[7]="Gi¸o chñ",
}

WorldInsidePos = {

	[200] = {200,1254,2738},
	[300] = {300,1702,3665},
	[204] = {204,1501,3328}, -- ÉÙÁÖ
	[209] = {209,1528,3246}, -- Ø¤°ï
	[303] = {303,1810,3007}, -- ¶ëÃ¼
	[305] = {305,1440,3105}, -- ÌÆÃÅ
	[312] = {312,1713,3469}, -- Îäµ±
	[350] = {350,1525,2862},
	

}